const commons = {
  // 헤더
  님_로그인: '님이 로그인하셨습니다.',

  // 회원
  아이디: '아이디',
  약관에_동의: '약관에 동의합니다',
  비밀번호_확인: '비밀번호 확인',
  나머지_주소: '나머지 주소',
  
  이메일을_입력하세요: '이메일을 입력하세요.',
  비밀번호를_입력하세요: '비밀번호를 입력하세요.',
  비밀번호를_확인하세요: '비밀번호를 확인하세요.',
  회원명을_입력하세요: '회원명을 입력하세요.',
  가입유형을_선택하세요: '가입유형을 선택하세요.',
  우편번호를_입력하세요: '우편번호를 입력하세요.',
  주소를_입력하세요: '주소를 입력하세요.',
  생년월일을_입력하세요: '생년월일을 입력하세요.',
  성별을_선택하세요: '성별을 선택하세요.',

  학과명을_입력하세요: '학과명을 입력하세요.',
  학과번호를_입력하세요: '학과번호를 입력하세요.',
  학번을_입력하세요: '학번을 입력하세요.',
  학년을_입력하세요: '학년을 입력하세요.',
  지도교수를_선택하세요: '지도교수를 선택하세요.',
  부서명을_입력하세요: '부서명을 입력하세요.',
  부서번호를_입력하세요: '부서번호를 입력하세요.',
  사번을_입력하세요: '사번을 입력하세요.',
  담당과목을_입력하세요: '담당과목을 입력하세요.',

  회원가입_약관에_동의하세요: '회원가입 약관에 동의하세요',
  비밀번호가_일치하지_않습니다: '비밀번호가 일치하지 않습니다.',

  // 집단상담
  이미지_첨부: '이미지 첨부',
  상담사_선택: '상담사 선택',
  검색어를_입력하세요: '검색어를 입력하세요.',
  집단_상담_프로그램_목록: '집단 상담 프로그램 목록',
  집단_상담_프로그램_수정: '집단 상담 프로그램 수정',
  집단_상담_프로그램_등록: '집단 상담 프로그램 등록',
  프로그램명을_입력해주세요: '프로그램명을 입력해주세요.',
  설명을_입력하세요: '설명을 입력하세요.',
  상담사를_선택하세요: '상담사를 선택하세요.',
  정말_삭제하겠습니까: '정말 삭제하겠습니까?',

  // 상담이력
  상담_접수_목록: '상담 접수 목록',
  정말_변경하겠습니까: '정말 변경하겠습니까?',

  // 게시판
  게시판_수정: '게시판 수정',
  게시판_등록: '게시판 등록',
  게시판_ID를_입력하세요: '게시판 ID를 입력하세요',
  게시판_이름을_입력하세요: '게시판 이름을 입력하세요',
  파일을_선택하세요: '파일을 선택하세요.',
  이미지_형식의_파일만_업로드하세요: '이미지 형식의 파일만 업로드하세요.',
  필수항목_gid_누락: '필수항목(gid) 누락',
};

export default commons;
